[
    {
    "name": "Dental Checkup",
    "picture": "https://www.woodbridgedental.co.uk/wp-content/uploads/2020/03/dental-checkup-guildford.jpg",
    "rating": 40,
    "time": "1.5hrs",
    "description": "If you have not been to the dentist in a while, I invite you to schedule your dental checkup with Smiles Dental Care. At my Mountain View dental office, I treat patients of all ages, focusing on improving the health and appearance of our patients' smiles. I understand that not everyone is excited about dental care. I also understand that due to busy schedules, a lack of insurance, or general forgetfulness, people do not visit the dentist with any regularity. If that is you, do not worry; you are not alone. According to the USA Today, 34 percent of Americans do not visit the dentist on an annual basis. While this is a large group of people, not having a dental checkup can place you at risk for a variety of health issues. We encourage you to take an hour out of your day for the benefit of your oral health and your future quality of life. To get started, all you need to do is call (650) 563-1180 and schedule an appointment. Our friendly staff will not judge you for your lack of prior dental care but will be happy to get you up to speed again.",
    "details":[
        {
            "title":"Why You Need a Dental Checkup",
            "detail":"There is a direct link between visiting the dentist and keeping your natural teeth. If you want to ensure that you have a full mouth of health teeth, then visit the dentist. Gallup Poll released a study in 2014 finding that the states with the highest percentage of dental visits also had the lowest percentage of adult tooth loss. For example, in Connecticut, 74 percent of adults visited the dentist in the past year, and their rate of adult tooth loss was only 9 percent. On the other hand, only 57 percent of adults in West Virginia visited the dentist in the past year, and 37 percent of adults have complete tooth loss. The correlation is clear and should prompt you to give us a call. If you do lose your teeth, we can help by providing you with replacements in the form of dental implants, bridges, or dentures. Still, there is no need for you to experience significant tooth loss when you visit our office regularly for preventative care. Saving your teeth, after all, is less time-consuming and less expensive. Another reason to schedule a dental check-up is to make sure that you don't experience a toothache or infection. We treat patients throughout the Mountain View area and find that toothaches can create enough discomfort to cause people to miss work. In fact, according to the Center for Disease Control, 164 million work hours are lost each and every year due to dental related health issues. If you have a busy schedule and feel you do not have time for the dentist, you definitely need to schedule a dental checkup. Failing to do so could result in a more serious health condition forming and the need to take time off of work. After all, without preventative dental care, you are at a greater risk for tooth decay, infection, and gum disease."
        },
        {
            "title":"What Happens at Your Dental Check-Up",
            "detail":"At Smiles Dental Care, we are a gentle dentist, being sure to complete your dental checkup in a way that is comfortable and relaxing. We understand that some people do not visit the dentist since they have a dental phobia or concern that something may be wrong. If this is the case, and you do have a cavity, we will treat your tooth gently and carefully so that we can address your dental health issues without causing you any further irritation."
        },
        {
            "title":"The Benefits of Coming in Now",
            "detail":"At Smiles Dental Care, we want you to visit our dentist office at the first sign of discomfort. If you have a slight toothache or irritation in your gums, you can schedule a dental exam. If there is a problem, we can correct it immediately, rather than allowing it to grow and spread. In many cases, we can help you to avoid experiencing any significant discomfort by simply removing the decayed area while it is still small. Otherwise, you may find yourself with a dental emergency as an untreated cavity spreads. Fortunately, we make it easy to schedule a dental checkup with our Mountain View dentist office. All you need to do is call (650) 563-1180 to schedule an appointment. We will work within your schedule to ensure that you receive the care you need, when you need it."
        },
        {
            "title":"Why You Shouldn’t Wait for Dental Care",
            "detail":"While we understand that many people wait to seek dental care due to anxiety, time, or finances, we do not recommend it. Instead, we suggest that you schedule a dental exam at least once every six months, even if you are not experiencing any discomfort. Doing so will allow us to remove any plaque or bacteria that is on your teeth, ensure that you do not have any cavities that are forming, and prevent you from experiencing gum disease. Our goal is to treat you before you have any health issues, and a dental checkup allows us to do so. We welcome you to come in so that we can protect and improve your oral health."
        }
    ]
    },
    {
    "name": "Dental Crowns & Bridge",
    "picture": "https://www.alamospringsdental.com/blog/wp-content/uploads/2019/12/AdobeStock_279747898__1576159907_87504.jpg",
    "rating": 5,
    "time": "6 days (appoximately 3hours per day)",
    "description": "At my Dental Care, I provide dental crowns and bridges for patients throughout the Mountain View area. These procedures are extremely effective for restoring a tooth that has become infected, damaged or has fallen out. We can complete these procedures in a way that looks natural while resolving oral health issues. This way, a patient can regain the functionality of their tooth without giving the appearance of any dental work. If you live in Mountain View, CA call (650) 563-1180 to schedule your appointment so that you can learn more about dental crowns and dental bridges.",
    "details":[
        {
            "title":"What are dental crowns?",
            "detail":"A dental crown is a cap that surrounds the tooth. We typically use a crown to restore a damaged tooth, but they can also use it to improve the appearance of a smile. A crown can consist of three different materials, all-metal, ceramic-on-metal and all-ceramic. The location of the crown in the teeth will determine the best material to use. For example, front teeth need to have an all-ceramic crown, if possible, since it looks the most natural. Patients may often use ceramic-on-metal crowns since they look natural but have the durability that only metal can provide."
        },
        {
            "title":"What are dental bridges?",
            "detail":"A dental bridge is a way to replace a missing tooth. At Smiles Dental Care, we provide clients with dental bridges if they want to replace a tooth without wearing dentures or undergoing surgery. The new tooth is held in place by two crowns. It looks natural and consists of a ceramic or porcelain material to match the surrounding teeth. As a cosmetic dentist, William S. Hall D.D.S. will make sure that the new tooth looks and feels amazing."
        },
        {
            "title":"Before the Procedure",
            "detail":"If you are getting dental crowns or a dental bridge for cosmetic reasons, we recommend that you whiten your teeth first. At Smiles Dental Care, we offer teeth whitening procedures that can improve the appearance of your smile quickly and easily. It is important to have this procedure done first because the material that crowns and bridges are made out of are both stain and bleach resistant. That means that if it is created to match yellow teeth, it will remain yellow even if you have your teeth whitened at a later date. When you have the procedure done first, your new crown or bridge will be made to match your new brilliantly white teeth.When preparing for the procedure, we recommend that patients take a day off of work. If possible, you may want to take a couple of days off. It is normal for teeth to be somewhat sensitive, and it is easier if you don't have to worry about meeting clients and keeping up with your busy schedule."
        },
        {
            "title":"The Process",
            "detail":"When getting dental crowns and dental bridges installed, it is advisable that you work with a cosmetic dentist that knows how to complete the procedure in a way that looks natural. At Smiles Dental Care, we can do so while also working to keep our patients as comfortable as possible by using sedation dentistry. The process for both procedures is fairly similar. Before getting started, an impression is taken of the teeth so that the new crown or bridge can be created in a dental lab. When placing a dental crown around a tooth, Smiles Dental Care starts by preparing the tooth. We will need to remove a portion of the enamel so that there is room for the new crown to surround the tooth without pushing other teeth out of place. Once complete, we will clean the tooth and secure a temporary crown to it using removable glue. Patients typically wear a temporary crown for around two weeks while waiting for a permanent one to be created in the lab. During this time, it is important to be careful with what you eat and how you brush your teeth since the temporary is designed to come off.When the dental restoratives are complete, patients return to our Mountain View dentist office, so that we can remove the temporaries and bond the permanent ones to the tooth. For a dental crown, we will secure the cap around the tooth and complete it through dental bonding. With a bridge, a crown is placed on the two teeth that are surrounding the missing one. On top of the crown is a piece that looks like natural gums that will hold the new tooth in place. These two crowns serve as anchors for this synthetic 'bridge' and makes a new tooth as durable as it can be. Patients depend on this procedure as a way to replace missing teeth in a way that looks natural and restores the functionality of the missing tooth. "
        }
    ]
    },
    {
    "name": "Dental Implants",
    "picture": "https://www.vervedental.com.au/wp-content/uploads/2022/05/Dental-implant.jpeg",
    "rating": 4.5,
    "time": "15 days (appoximately 4 hours per day)",
    "description": "Missing teeth can be embarrassing, causing people to hide their smile and lose their self-esteem. The space that missing teeth create can easily become infected with bacteria, causing other teeth to shift out of place, and making it difficult for people to speak or eat correctly. The team at Smiles Dental Care are sensitive to the hardship a missing tooth can create. We provide dental implants so that our patients can regain their self-confidence, improve their health, and approach life boldly. Installing implants is a complex procedure that requires us to replace their missing teeth in a safe and natural way. We know that there are multiple dental providers to choose from, so the team at Smiles Dental Care are constantly looking for ways to improve the overall experience of our patients. Our office is located in Mountain View and we offer patients the opportunity to restore missing teeth in a way that looks natural and beautiful.",
    "details":[
        {
            "title":"The Process of Installing Implants",
            "detail":"If one or more of your teeth fall out, you may qualify for dental implants as a way to permanently replace the missing teeth. In order to find out, schedule an appointment with our Mountain View dentist office by calling (650) 563-1180. We will examine your mouth and jawbone to determine if the procedure is right for you. Before we begin the procedure, your gums need to be healthy, and your jawbone needs to be strong. If we identify any cavities or signs of gum disease, we will need to treat it prior to the dental implant procedure. Once you are cleared for the procedure, the staff at Smiles Dental Care will take an impression of your mouth to create a new tooth in a dental lab. Each synthetic tooth will match the size and shape of the surrounding teeth, along with having a perfect color match. This way your smile will appear completely natural once we complete the procedure. Many patients are satisfied with the results since no one can tell the difference between which teeth are real and which ones are synthetic."
        },
        {
            "title":"Mountain View Dental Implants",
            "detail":"The next step in the procedure is to implant a metal post under the gum line. This aspect of the procedure is what sets an implant apart from other forms of cosmetic dentistry. The metal post is secured to the jawbone in order to create a durable, synthetic root system that rivals the strength of natural roots; with one exception that the metal cannot face infection. Over the course of a couple of months, the metal post and jawbone will fuse together. This creates a level of durability that cannot be replicated in other types of procedures. Afterward, we will secure the new synthetic tooth to the metal post at the surface of the gums. The new tooth is attached so securely, that patients can eat their favorite foods, maintain an active lifestyle, play sports, and more, without fear of their tooth becoming loose or falling out. Patients can enjoy the benefits that come from never having to worry about their tooth again.The team at Smiles Dental Care provide dental implants in a way that is comfortable and functional. We take the time to make sure that every aspect of the procedure is completed correctly – the first time. Teeth restored with implants will not get cavities. A replacement tooth, or crown, does not decay like a natural tooth. However, you still need to brush, floss and care for it and your surrounding natural teeth in the same manner as natural teeth. Regular professional cleanings and dental checkups are also essential."
        },
        {
            "title":"Caring for Dental Implants",
            "detail":"Once implants have been installed, they are extremely easy to care for. We hear patients throughout Mountain View ask questions that range from 'Do implants come out' to 'How do I brush my teeth'. Fortunately, the answers are not as complex as some people might believe. Since we install dental implants by creating a synthetic root system, they are durable and secure. The dental implants will not fall out or become loose. This means you can go play basketball, run in a 10k marathon, and wrestle with your kids – without worrying about your tooth coming out.  In order to care for your implants, we advise patients to brush and floss their teeth throughout the day like normal. Additionally, it is important to schedule dental exams and cleanings with William S. Hall D.D.S. at least twice a year. The staff at Smiles Dental Care will help to clean your teeth and ensure that they stay healthy. While dental implants cannot become infected themselves, the teeth around them can. If, in the future, you suffer from a severe case of gum disease or a dental abscess, the infection can spread into your jawbone. This puts your implants in jeopardy because in order to stay secure, the jawbone must be in good health. If it becomes infected, your dental implants and all of your teeth will be in jeopardy."
        },
        {
            "title":"Consultation",
            "detail":"In order to find out if implants are right for you, call (650) 563-1180. The team at Smiles Dental Care are friendly, welcoming, and will take the time to inform you of all of your options. We will make a detailed recommendation about the best choice for your oral health by customizing it to your needs. Just remember that you can have a beautiful and natural looking smile by working with a professional implant dentist. If you are suffering from missing teeth, we can help you by transforming your smile. Schedule an appointment and let us transform your smile into something as beautiful as you are."
        }
    ]
    },
    {
    "name": "Dental Veneers and Dental Laminates",
    "picture": "https://elevatedental.ph/wp-content/uploads/2018/02/porcelain-laminate-veneer.jpg",
    "rating": 5,
    "time": "3 days (appoximately 4 hours per day)",
    "description": "I provide dental veneers so that patients can restore damaged teeth or transform their smile into something beautiful. At my Dental Care I often treat patients that have a variety of dental concerns. Some patients visit  my office because they break their tooth, while others are looking to create a Hollywood smile. Most people are candidates for the procedure as long as their tooth structure and roots are in place. If, however, you have a cavity or gum disease, this will need to be treated before we complete the procedure. If you want to learn more about dental veneers, we recommend that you call (650) 563-1180 to schedule an appointment. We are a provider of veneers and can let you know if they will help you to achieve the goals that you have for your smile.",
    "details":[
        {
            "title":"What is a Dental Veneer?",
            "detail":"A veneer is a thin shell that is made out of porcelain or ceramic. The shade of the veneer, along with its shape and size will be made to match your surrounding teeth so that it blends in perfectly."
        },
        {
            "title":"How is a Dental Veneer Used?",
            "detail":"I can accomplish a variety of things using dental veneers. By placing veneers on top of the teeth, we can close gaps, make teeth even in length, cover dark stains and create a uniform looking smile. In this way, veneers can create a smile that rivals the most famous Hollywood stars.The nice thing is that you do not have to be famous to improve your smile. You simply need to call 650-563-1180 and schedule an appointment to see William S. Hall D.D.S."
        },
        {
            "title":"Mountain View, California Veneers",
            "detail":"We also use dental veneers for restorations. When teeth become cracked, chipped or broken, a veneer can restore the tooth to its full functionality. As long as the tooth structure is intact, we can restore the appearance of a tooth while making it possible to eat and speak without feeling any discomfort."
        },
        {
            "title":"The Procedure",
            "detail":"When patients visit our Smiles Dental Care offices, we will take an impression of their teeth to create the veneers in a lab. The veneers will match the size, shape, and color of your teeth, taking a week or more to create. In order to place dental veneers, we will first prepare your tooth by removing a portion of the enamel. This helps the veneer lay flat and in line with your gum tissue. After preparing the tooth, we will secure a temporary veneer using removable glue. While wearing a temporary veneer, it is important to brush your teeth gently and avoid eating any foods that may push it out of place. Since it is secured by removable glue, it can be moved fairly easily. When your permanent veneers are ready, you will come back into our Smiles Dental Care offices so that we can remove the temporary and ensure that the new veneer is a perfect fit. It is typically attached using a water based solution to see how it looks. If any adjustments need to be made, it will be done at this time. Otherwise, the tooth will be cleaned, and the dental veneer will be bonded to the tooth. Patients will enjoy how the results look. They are instant, and you can start flashing your smile right away."
        },
        {
            "title":"Benefits of Dental Veneers",
            "detail":"One main benefit of veneers that patients enjoy is how the veneers make their teeth look. This procedure is an excellent solution, since the veneers can transform your smile into one that looks perfect and beautiful. The veneer uses your natural teeth, so there is no need for surgery, and the recovery time is reduced. Since the veneers are made to match your other teeth, they will look natural, and no one will be able to tell that you had any cosmetic dentistry work completed. Another benefit is that they are made out of a stain resistant material. This means that your teeth will stay whiter and brighter, even if your favorite beverage is a hot cup of coffee. We can use dental veneers to transform your smile."
        }
    ]
    },
    {
    "name": "Teeth Whitening",
    "picture": "https://www.preferreddentalcaresantarosa.com/wp-content/uploads/2020/02/Is-Dental-Tartar-Cleaning-Dangerous-min.jpg",
    "rating": 4.5,
    "time": "3 hours",
    "description": "If you live in Mountain View or the local area, you can benefit from a teeth whitening procedure at my local dental office. At Smiles Dental Care, we are known for improving the appearance of our patients' smiles. We are a cosmetic dentist and has multiple ways for doing so. We often recommend a teeth bleaching procedure because it is by far the easiest way to transform your smile. After cleaning your teeth, we can complete this procedure in time for a special event or as part of your regular oral health routine.",
    "details":[
        {
            "title":"Help Your Smile Shine Bright",
            "detail":"People have their teeth whitened on a regular basis so that they can look and feel great. As people age, it is common for teeth to become dull and yellow. This is in part due to age itself and also due to what a person eats and drinks. Drinking coffee, tea and wine, for example, can stain your teeth. Smoking and eating foods that contain food coloring can also stain your teeth. Brushing immediately after eating and drinking can help to prevent stains but is typically not enough to remove the risk entirely. Fortunately, stained and yellow teeth don't have to stay that way."
        },
        {
            "title":"Types of Whitening",
            "detail":"There are several types of teeth bleaching that you can try. People typically start by using whitening toothpaste at home. This can help to brighten your teeth but is typically not enough to actually whiten them. We recommend toothpaste as part of an overall teeth whitening treatment but not by itself. After professional whitening, the toothpaste can help your teeth stay bright. Many people may try over the counter solutions like whitening trays or strips. These treatments work but not as well as professional solutions. As with most things, what you buy in the store is simply not as strong as what you can get from a medical professional. Additionally, store bought whitening trays are designed to fit everyone's teeth, not your teeth specifically. This means that they can become loose, and the solution can leak, leading to gum irritation. We recommend that people in Mountain View, schedule an appointment with William S. Hall D.D.S. instead. Our professional tooth whitening solutions can transform the appearance of your teeth in a dynamic way. This is partially due to the strength of the solution that we use. Professional grade whitening gel can whiten teeth by eight shades or more vs. around two shades with store bought solutions. If you are looking for immediate and dramatic results, in-office whitening is a far better option."
        },
        {
            "title":"Mountain View Tooth Whitening",
            "detail":"At Smiles Dental Care, we provide patients with information on two main types of dental whitening. Some dental offices provide whitening services in the office while others focus on treatments that can be completed at home. An in-office treatment can be done at the same time as a teeth cleaning or during a separate appointment. It is typically completed within an hour and produces immediately white teeth. For many people, this is an ideal solution because of how quickly it is finished."
        },
        {
            "title":"The process: How It Works",
            "detail":"When a whitening solution is applied to the teeth, the hydrogen peroxide inside of the solution penetrates through the enamel. It then starts the oxidation process where molecules are transformed to reflect less or no light. This makes them appear colorless, and teeth appear white. This process is typically extremely effective for eliminating stains and can be repeated frequently. On occasion, the stains are too strong for a teeth bleaching procedure to work. When this happens, we can provide an alternative treatment. For example, patients in Mountain View can have dental veneers placed on the surface of teeth in order to cover dark stains. This is often preferable for patients that smoke since veneers are stain resistant and won't yellow quickly like natural teeth. Still, it is wise to try a teeth whitening procedure first, before starting a cosmetic one. At Smiles Dental Care, we also recommend that patients have their teeth whitened before having other dental procedures completed. Most of the materials that are used in dental restorations or for cosmetic purposes are stain resistant and bleach resistant. For example, a dental crown won't stain or bleach but should maintain its initial coloring with time. When a crown, veneer, bridge, or implant is created in a dental lab, they are created to match the shade of the surrounding teeth. If the surrounding teeth are yellow, these restorations will be created in a yellow shade. If the surrounding teeth are a brilliant white, the restoration will be as well. This makes the timing of teeth whitening procedures important. If you live in the Mountain View area and are interested in a dental restoration, schedule your teeth whitening procedure first."
        }
    ]
    },
    {
    "name": "Root Canal Treatment",
    "picture": "https://www.raghavhealthcare.com/images/root-canal-treatment-in-bangalore.jpg",
    "rating": 5,
    "time": "9 days (appoximately 3 hours per day)",
    "description": "At my Dental Care, I regularly perform a root canal endodontic treatment in order to remove infections and save our patients' teeth. I can complete the procedure and work to keep patients comfortable. Root canals are a common procedure. If you live in the Mountain View area and are currently experiencing tooth pain, we invite you to call (650) 563-1180 to schedule an appointment and see if you need a root canal endodontic treatment.",
    "details":[
        {
            "title":"Why do most people need a root canal?",
            "detail":"When a tooth becomes infected, that infection can spread into the center of the tooth. This area is called the dental pulp. Inside of the dental pulp is the nerves, connective tissue, and blood vessels. All of the sensitive areas of the tooth are contained here. As such, when the area becomes infected it can be incredibly painful, requiring immediate treatment. We can perform a root canal quickly on people living in and around the Mountain View area."
        },
        {
            "title":"How does the treatment work?",
            "detail":"A root canal endodontic procedure works by creating a small hole in the tooth so that all of the infected areas can be removed. The dental pulp is removed, and oftentimes so are the roots. You only need your tooth roots to feel sensations like hot and cold and for the tooth to grow in. Once it has fully matured, removing the roots will not directly harm the tooth. It can, however, prevent the further spread of infection so when it is necessary to remove the roots; we promptly do so. Once done, we will clean the area to ensure that the infection is gone. We will typically prescribe antibiotics, as well. This ensures that any lingering infection is eliminated. In order to complete the root canal, we will seal up the hole and area where the dental pulp used to be. This is typically done with something called gutta-percha. This is a rubber-like substance that can help to stabilize the tooth now that a portion is missing. At Smiles Dental Care, we will then use a filling or crown in order to further strengthen and protect the damaged tooth. Both fillings and crowns can now be created in a tooth-color. This means that regardless of where your infected tooth is located, a crown can be used, and it will blend in seamlessly with the surrounding teeth. Patients throughout the Mountain View area appreciate how natural their tooth looks once the procedure is complete."
        },
        {
            "title":"Why should I have a root canal endodontics treatment?",
            "detail":"If you live in Mountain View, CA you should schedule an appointment with us to discuss the health of your teeth, any problems that you may be having and what should be done to heal and protect the tooth. If it appears that a root canal is the best option, we will make this recommendation. If not, we will present a treatment solution that will solve your health issue. Overall, a root canal endodontics treatment is extremely effective for saving damaged teeth by removing any infection that may be there. This single treatment makes it possible for millions of teeth to be saved on an annual basis and once it is completed; eating and drinking becomes easy again."
        },
        {
            "title":"What about discomfort?",
            "detail":"We work to help patients to feel comfortable during their root canal endodontics procedure by using sedation dentistry. We have a variety of ways that we can eliminate both discomfort and anxiety during a root canal. Whether a patient needs to take something ahead of time to relax or medication to numb the specific area that is being worked on, we can provide painless dentistry and help patients enjoy their dental treatments."
        },
        {
            "title":"What are the advantages of this procedure?",
            "detail":"In the past, many people would need to have their teeth pulled if they became severely infected or the dental pulp became inflamed. Now, those same teeth can be saved by performing a root canal. This is a far better option because it keeps the natural tooth in place. This is important for the shape of the face because as teeth fall out the muscles in the face can start to sag. While this is not particularly common with the loss of one tooth, it is when several become infected and fall out. By treating and saving an infected tooth, we are helping to preserve our patients' facial structure. Another benefit is that once the root canal has been completed, and the filling or crown is in place; it is possible to eat like normal and without restrictions. Once the infection is gone, and the tooth is strengthened, it will behave like it used to. That makes it possible to bite down with normal force, chew, and maintain normal activities without worrying about the tooth. This helps patients throughout Mountain View get back to return to their busy schedules. A restored tooth will look completely natural if a tooth-colored crown or filling is used to restore it. In fact, crowns can be created in the exact shade of the surrounding teeth so that it blends in perfectly. This way no one will know that you ever had a procedure completed. If, in fact, you had a root canal done previously, you may want to have the filling or crown around it replaced with today's version for an improved appearance. Alternatively, if don't have a root canal endodontics procedure completed, the infected tooth will likely need to be pulled. This is essential for preventing the spread of infection. Once the tooth is removed it will need to be replaced. The options for doing so involve wearing a denture, getting a dental bridge or having dental implants installed. These are all viable solutions but take additional time, and the recovery period is longer since the procedures will take several steps. Therefore, one possible solution is for us to attempt to save your tooth by performing a root canal endodontics procedure. To learn more about this option call Smiles Dental Care at 650-563-1180 and schedule an appointment."
        }
    ]
    }
    
]